## JavaScript笔记————call、apply和bind

bind是返回对应函数，便于稍后调用；apply、call是立即调用

#### 1.call()

call([thisObj[,arg1[, arg2[, [,.argN]]]]])

定义:调用一个对象的一个方法，以另一个对象替换当前对象。可将一个函数的对象上下文从初始的上下文改为由thisObj指定的新对象。

thisObj的取值有4种情况：

(1)不传，或者传null或者undefined，函数中的this指向window对象 <br>
(2)传递另一个函数的函数名，函数中的this指向这个函数的引用。
<br>
(3)传递字符串、数值或者布尔类型等基础类型，函数中的this指向其对应的包装对象。如String、Number、Boollen
<br>
(4)传递一个对象，函数中的this指向这个对象

call()方法就是把改变函数体的作用域，把方法交给call传入的对象使用；

#### 2.apply()

对于apply和call而言，二者作用完全一样，只是接受参数的方法不太一样。

call需要把参数按顺序传递进去，apply是把参数放在数组里

当明确参数数量时候使用call，不确定的时候使用appl

#### 3.bind()

bind()方法和apply和call相似，也是可以改变函数体内的this指向。
bind()方法会创建一个新的函数，称为绑定函数，当调用这个绑定函数时，绑定函数会以创建它时传入bind()方法的第一个参数作为this，传入bind()方法的第二个以及以后的参数加上绑定函数运行时本身的参数按照顺作为原函数的参数来调用原函数。

未完待续……
